mui.init({swipeBack: false
,gestureConfig: {tap: true,doubletap: true,longtap: true}});

var 面板_搜索 = new 面板("面板_搜索");
var 编辑框_搜索 = new 编辑框("编辑框_搜索",null,null,null,null,null);
var 网络操作_搜索 = new 网络操作("网络操作_搜索",网络操作_搜索_发送完毕);
var 图片框_返回 = new 图片框("图片框_返回",图片框_返回_被单击);
var 标签_按钮 = new 标签("标签_按钮",标签_按钮_被单击);
var 编辑框1 = new 编辑框("编辑框1",null,null,null,null,null);
var 正则_搜索 = new 正则("正则_搜索");
var 列表框1 = new 列表框("列表框1",true,列表框1_表项被单击,null);
var 列表框_类型 = new 列表框("列表框_类型",true,null,null);
var 对话框1 = new 对话框("对话框1",null,null,null);
var 仔仔1 = new 仔仔("仔仔1",null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null);
if(mui.os.plus){
    mui.plusReady(function() {
        搜索资源窗口_创建完毕();
        
    });
}else{
    window.onload=function(){ 
        搜索资源窗口_创建完毕();
        
    }
}

function 搜索资源窗口_创建完毕(){
	窗口操作.锁定屏幕方向(1);
	面板_搜索.置高度("40px");
	面板_搜索.添加组件("图片框_返回","8%");
	面板_搜索.添加组件("编辑框_搜索","80%");
	面板_搜索.添加组件("标签_按钮","12%");
	面板_搜索.置外边距("0px","0px","10px","0px");
	面板_搜索.置内边距("0px","5px","0px","5px");
	编辑框_搜索.置背景颜色(0,0,0,0.08);
	标签_按钮.置标题("搜索");
	图片框_返回.置图片("images/return.png");
	窗口操作.置组件外边距("图片框_返回","12px","0px","0px","2px");
	窗口操作.置组件外边距("编辑框_搜索","6px","0px","8px","0px");
	窗口操作.置组件外边距("标签_按钮","10px","0px","0px","0px");
}

function 网络操作_搜索_发送完毕(发送结果,返回信息){
	编辑框1.置内容(文本操作.删全部空(返回信息));
	列表框1.清空项目();
	列表框_类型.清空项目();
	var i搜索= 0;
	var 地址;
	var 标题;
	var 类型;

	正则_搜索.创建正则(编辑框1.取内容(),"b-mainpic\"><ahref=\"(.*?)\"class=\"g-playiconjs(\[\\s\\S\]*?)title=\"(.*?)\"data(\[\\s\\S\]*?)playtype\">(.*?)</span>");
		while(i搜索 != 正则_搜索.取匹配数量()){

		地址 = 正则_搜索.取子匹配文本(i搜索,1);
		标题 = 正则_搜索.取子匹配文本(i搜索,3);
		类型 = 正则_搜索.取子匹配文本(i搜索,5);
		列表框1.添加项目(标题,地址,"mui-btn mui-btn-success",类型);
		列表框_类型.添加项目(类型,"","","");

		i搜索 = i搜索 + 1;
		}


}

function 标签_按钮_被单击(){
	if (编辑框_搜索.取内容() != "" && 编辑框_搜索.取内容() != null) {
		网络操作_搜索.发送网络请求("https://so.360kan.com/index.php?kw=" + 编辑框_搜索.取内容(),"get","txt","",5000);
		}else {
		对话框1.信息框("不要皮","搜索内容空空如也~");
	}
}

function 列表框1_表项被单击(项目索引,项目标题,项目标记){
	var 分割;
	var 账号密码= 读写设置.读取设置("user");
	if (文本操作.寻找文本(账号密码,"----",0) != -1){
		分割 = 文本操作.分割文本(账号密码,"----");
		}else {

		return;
	}
	if (分割[0] != null && 分割[0] != "" && 分割[1] != null && 分割[1] != "" && 读写设置.读取设置("loginstate") != "" && 读写设置.读取设置("loginstate") != null){
		if(数学操作.取整数(读写设置.读取设置("vip")) < 数学操作.取整数(仔仔1.时间_当前时间戳())){
			对话框1.信息框("温馨提示","您的VIP账户已到期");
			}else {
				if (列表框_类型.取项目标题(项目索引) == "[电影]"){
						读写设置.保存设置("播放分类","电影");
					}else if(列表框_类型.取项目标题(项目索引) == "[电视剧]"){
						写设置.保存设置("播放分类","电视");
					}else if(列表框_类型.取项目标题(项目索引) == "[综艺]") {
						读写设置.保存设置("播放分类","综艺");
					}else if(列表框_类型.取项目标题(项目索引) == "[动漫]") {
					读写设置.保存设置("播放分类","动漫");
				}
					读写设置.保存设置("播放标题",项目标题);
					读写设置.保存设置("播放地址",项目标记);
					窗口操作.切换窗口("bofangye.html","");
			}
				}else {
			对话框1.信息框_全局("请先登陆后使用");
		窗口操作.切换窗口("denglu.html","");
	}

}

function 图片框_返回_被单击(){
	窗口操作.销毁窗口("soso.html");
}